# Q1. List any five functions of the pandas library with execution.

ans - five functions that are used in pandas library are :-
1. head() fuction - this function allows user to see first five records of the given dataset
2. columns function -  this function shows all the names of the columns present in the dataset
3. describe() function - this function defines the columns with data type int or float used for calculating some statistical data like percentile, mean and std of the Series or DataFrame. 
4. loc function - The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select
5. iloc function -The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column.

In [2]:
import pandas as pd
df =  pd.read_csv("titanic.csv")

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
df.loc[2:4,['PassengerId', 'Survived' ,'Pclass']]

   PassengerId  Survived  Pclass
2            3         1       3
3            4         1       1
4            5         0       3

In [10]:
df.iloc[2:4,[2,3,4]]

   Pclass                                          Name     Sex
2       3                        Heikkinen, Miss. Laina  female
3       1  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [43]:
def reindex_dataframe(df):
    df = df.reset_index(drop=True)
    df.index = df.index.map(lambda x: x*2+1)
    return df

data= {'A':[1,2,3],
       'B':[4,5,6],
       'C':[7,8,9]}
df=pd.DataFrame(data)
print(df)
df = reindex_dataframe(df)
print(df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [1]:
import pandas as pd

In [17]:
data = {'Values' : [10,20,30,40,50]}
df = pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [20]:
def sum(df):
    temp=1
    sum = 0
    for i in df['Values']:
        sum = sum  + i
        if temp == 3:
            break
        else:
            temp+=1
    print("sum of first 3 values are :-", sum)
    
sum(df)

sum of first 3 values are :- 60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [39]:
data = {'Text' : ['Hello','Python','PwSkills','NewDelhi']}
df = pd.DataFrame(data)
df

       Text
0     Hello
1    Python
2  PwSkills
3  NewDelhi

In [119]:
def Wordcount(df):
    list = []
    for word in df['Text']:
        length = len(word)  
        list.append(length)
    df['Word_Count'] = list
    return df

In [120]:
Wordcount(df)

       Text  Word_Count
0     Hello           5
1    Python           6
2  PwSkills           8
3  NewDelhi           8

# Q5. How are DataFrame.size() and DataFrame.shape() different?

In [52]:
size = df.size
shape = df.shape
print('size of the dataframe is ' , size)
print('shape of the dataframe is' , shape)

size of the dataframe is  8
shape of the dataframe is (4, 2)

1. DataFrame.size()- is the function which defines the total size of the dataframe
 
2. DataFrame.shape() - is the function which defines the shape of the dataframe or can say which defines the value of the coordinats of the dataframe

# Q6. Which function of pandas do we use to read an excel file?

ans - read_excel('file_name') is the function which is used to read the excel file in the pandas library

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
# The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [77]:
data = {'Email' : ['piyush@gmail.com', 'shashank@gmail.com' ,'kunal@gmail.com' ,'gourav@gmail.com' , 'tushar@gmail.com']}
df2 = pd.DataFrame(data)
df2

                Email
0    piyush@gmail.com
1  shashank@gmail.com
2     kunal@gmail.com
3    gourav@gmail.com
4    tushar@gmail.com

In [117]:
def extraction(df):
    list1 = []
    for email in df2['Email'] :
        count = 0
        for word in email:
            if word == '@':
                list1.append(email[:count])
            else:
                count = count+1
    df2['Username'] =list1
    
    return df2

In [118]:
extraction(df2)

                Email  Username
0    piyush@gmail.com    piyush
1  shashank@gmail.com  shashank
2     kunal@gmail.com     kunal
3    gourav@gmail.com    gourav
4    tushar@gmail.com    tushar

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
# For example, if df contains the following values:

       A B C
     0 3 5 1
     1 8 2 7
     2 6 9 4
     3 2 3 5
     4 9 1 2

# Your function should select the following rows: A B C
    1 8 2 7
    4 9 1 2
# The function should return a new DataFrame that contains only the selected rows.

In [104]:
data3 = {'A':[3,8,6,2,9],'B':[5,2,9,3,1] ,'C':[1,7,4,5,2]}
df3 = pd.DataFrame(data3)
df3

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [113]:
def selection(df):
    df4 = df[(df['A']>5) & (df['B']<10)]
    return df4

In [114]:
selection(df3)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [126]:
data = {'Values' : [10,20,30,40,50]}
df5 = pd.DataFrame(data)

def values(df):
    mean= df['Values'].mean()
    median= df['Values'].median()
    sd= df['Values'].std()


    print(f"mean is: {mean}")
    print(f"median is: {median}")
    print(f"srandard deviation is: {sd}")

values(df5)

mean is: 30.0
median is: 30.0
srandard deviation is: 15.811388300841896

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [127]:
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()


df = pd.DataFrame({'Date': pd.date_range(start='2023-09-01', periods=10),
                   'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]})

calculate_moving_average(df)
print(df)

        Date  Sales  MovingAverage
0 2023-09-01     10           10.0
1 2023-09-02     20           15.0
2 2023-09-03     30           20.0
3 2023-09-04     40           25.0
4 2023-09-05     50           30.0
5 2023-09-06     60           35.0
6 2023-09-07     70           40.0
7 2023-09-08     80           50.0
8 2023-09-09     90           60.0
9 2023-09-10    100           70.0

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a newcolumn 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.

    Monday, Tuesday) corresponding to each date in the 'Date' column.
    For example, if df contains the following values:
    Date
    0 2023-01-01
    1 2023-01-02
    2 2023-01-03
    3 2023-01-04
    4 2023-01-05
    Your function should create the following DataFrame:

    Date Weekday
    0 2023-01-01 Sunday
    1 2023-01-02 Monday
    2 2023-01-03 Tuesday
    3 2023-01-04 Wednesday
    4 2023-01-05 Thursday
    The function should return the modified DataFrame.

In [128]:
def add_weekday_column(df):
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

# Example usage
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
df['Date'] = pd.to_datetime(df['Date'])

df = add_weekday_column(df)
print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [129]:
def select_rows_between_dates(df):
    start_date = pd.to_datetime('2023-01-01')
    end_date = pd.to_datetime('2023-01-31')
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    return selected_rows

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-10']})
df['Date'] = pd.to_datetime(df['Date'])  
selected_df = select_rows_between_dates(df)
print(selected_df)

        Date
0 2023-01-01
1 2023-01-15
2 2023-01-31

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

ans - we use pandas library to use pandas function